#pragma once

// clang-format off

// This file is generated from the Game's Reflection data

#include <cstdint>
namespace RED4ext
{
struct CensorshipFlags
{
    uint32_t Censor_Nudity : 1; // 0
    uint32_t Censor_OverSexualised : 1; // 1
    uint32_t Censor_Suggestive : 1; // 2
    uint32_t Censor_Homosexuality : 1; // 3
    uint32_t Censor_Gore : 1; // 4
    uint32_t Censor_Drugs : 1; // 5
    uint32_t Censor_Religion : 1; // 6
    uint32_t Censor_Chinese : 1; // 7
    uint32_t b8 : 1; // 8
    uint32_t b9 : 1; // 9
    uint32_t b10 : 1; // 10
    uint32_t b11 : 1; // 11
    uint32_t b12 : 1; // 12
    uint32_t b13 : 1; // 13
    uint32_t b14 : 1; // 14
    uint32_t b15 : 1; // 15
    uint32_t b16 : 1; // 16
    uint32_t b17 : 1; // 17
    uint32_t b18 : 1; // 18
    uint32_t b19 : 1; // 19
    uint32_t b20 : 1; // 20
    uint32_t b21 : 1; // 21
    uint32_t b22 : 1; // 22
    uint32_t b23 : 1; // 23
    uint32_t b24 : 1; // 24
    uint32_t b25 : 1; // 25
    uint32_t b26 : 1; // 26
    uint32_t b27 : 1; // 27
    uint32_t b28 : 1; // 28
    uint32_t b29 : 1; // 29
    uint32_t b30 : 1; // 30
    uint32_t b31 : 1; // 31
};
RED4EXT_ASSERT_SIZE(CensorshipFlags, 0x4);
} // namespace RED4ext

// clang-format on
