#pragma once

// This file is generated from the Game's Reflection data

#include <cstdint>
namespace RED4ext
{
namespace world::ui { 
struct ContextVisibility
{
    uint64_t SceneDefault : 1; // 0
    uint64_t b1 : 1; // 1
    uint64_t b2 : 1; // 2
    uint64_t b3 : 1; // 3
    uint64_t b4 : 1; // 4
    uint64_t b5 : 1; // 5
    uint64_t b6 : 1; // 6
    uint64_t b7 : 1; // 7
    uint64_t SceneTier1 : 1; // 8
    uint64_t b9 : 1; // 9
    uint64_t b10 : 1; // 10
    uint64_t b11 : 1; // 11
    uint64_t b12 : 1; // 12
    uint64_t b13 : 1; // 13
    uint64_t b14 : 1; // 14
    uint64_t b15 : 1; // 15
    uint64_t SceneTier2 : 1; // 16
    uint64_t b17 : 1; // 17
    uint64_t b18 : 1; // 18
    uint64_t b19 : 1; // 19
    uint64_t b20 : 1; // 20
    uint64_t b21 : 1; // 21
    uint64_t b22 : 1; // 22
    uint64_t b23 : 1; // 23
    uint64_t SceneTier3 : 1; // 24
    uint64_t b25 : 1; // 25
    uint64_t b26 : 1; // 26
    uint64_t b27 : 1; // 27
    uint64_t b28 : 1; // 28
    uint64_t b29 : 1; // 29
    uint64_t b30 : 1; // 30
    uint64_t b31 : 1; // 31
    uint64_t SceneTier4 : 1; // 32
    uint64_t b33 : 1; // 33
    uint64_t b34 : 1; // 34
    uint64_t b35 : 1; // 35
    uint64_t b36 : 1; // 36
    uint64_t b37 : 1; // 37
    uint64_t b38 : 1; // 38
    uint64_t b39 : 1; // 39
    uint64_t SceneTier5 : 1; // 40
    uint64_t b41 : 1; // 41
    uint64_t b42 : 1; // 42
    uint64_t b43 : 1; // 43
    uint64_t b44 : 1; // 44
    uint64_t b45 : 1; // 45
    uint64_t b46 : 1; // 46
    uint64_t b47 : 1; // 47
    uint64_t b48 : 1; // 48
    uint64_t b49 : 1; // 49
    uint64_t b50 : 1; // 50
    uint64_t b51 : 1; // 51
    uint64_t b52 : 1; // 52
    uint64_t b53 : 1; // 53
    uint64_t b54 : 1; // 54
    uint64_t b55 : 1; // 55
    uint64_t b56 : 1; // 56
    uint64_t b57 : 1; // 57
    uint64_t b58 : 1; // 58
    uint64_t b59 : 1; // 59
    uint64_t b60 : 1; // 60
    uint64_t b61 : 1; // 61
    uint64_t b62 : 1; // 62
    uint64_t b63 : 1; // 63
};
RED4EXT_ASSERT_SIZE(ContextVisibility, 0x8);
} // namespace world::ui
} // namespace RED4ext
